; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing :action-costs)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot)
)
(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
 ;              (increase (total-cost) 5)
)
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
;               (increase (total-cost) 2)
)
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
;(increase (total-cost) 2)
)
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
  ;             (increase (total-cost) 3)
)
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
 ;              (increase (total-cost) 1)
)
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
;	       (increase (total-cost) 1)
)
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
;               (increase (total-cost) 1)
)
)

)

; problem
(define (problem p01-432)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 
           tile_1-1 tile_1-2 tile_1-3 
           tile_2-1 tile_2-2 tile_2-3 
           tile_3-1 tile_3-2 tile_3-3 
           tile_4-1 tile_4-2 tile_4-3 - tile
           robot1 robot2 - robot
           white black - color
)
(:INIT 
(available-color black) 
(available-color white) 
(clear tile_0-2)
(clear tile_0-3)
(clear tile_1-3)
(clear tile_4-1)
(clear tile_4-3)
(down tile_0-1 tile_1-1) 
(down tile_0-2 tile_1-2) 
(down tile_0-3 tile_1-3) 
(down tile_1-1 tile_2-1) 
(down tile_1-2 tile_2-2) 
(down tile_1-3 tile_2-3) 
(down tile_2-1 tile_3-1) 
(down tile_2-2 tile_3-2) 
(down tile_2-3 tile_3-3) 
(down tile_3-1 tile_4-1) 
(down tile_3-2 tile_4-2) 
(down tile_3-3 tile_4-3) 
(left tile_0-1 tile_0-2) 
(left tile_0-2 tile_0-3) 
(left tile_1-1 tile_1-2) 
(left tile_1-2 tile_1-3) 
(left tile_2-1 tile_2-2) 
(left tile_2-2 tile_2-3) 
(left tile_3-1 tile_3-2) 
(left tile_3-2 tile_3-3) 
(left tile_4-1 tile_4-2) 
(left tile_4-2 tile_4-3) 
(painted tile_1-1 white)
(painted tile_1-2 black)
(painted tile_2-1 black)
(painted tile_2-2 black)
(painted tile_2-3 black)
(painted tile_3-1 white)
(painted tile_3-2 white)
(painted tile_3-3 black)
(right tile_0-2 tile_0-1) 
(right tile_0-3 tile_0-2) 
(right tile_1-2 tile_1-1) 
(right tile_1-3 tile_1-2) 
(right tile_2-2 tile_2-1) 
(right tile_2-3 tile_2-2) 
(right tile_3-2 tile_3-1) 
(right tile_3-3 tile_3-2) 
(right tile_4-2 tile_4-1) 
(right tile_4-3 tile_4-2) 
(robot-at robot1 tile_0-1)
(robot-at robot2 tile_4-2)
(robot-has robot1 white)
(robot-has robot2 white)
(up tile_1-1 tile_0-1) 
(up tile_1-2 tile_0-2) 
(up tile_1-3 tile_0-3) 
(up tile_2-1 tile_1-1) 
(up tile_2-2 tile_1-2) 
(up tile_2-3 tile_1-3) 
(up tile_3-1 tile_2-1) 
(up tile_3-2 tile_2-2) 
(up tile_3-3 tile_2-3) 
(up tile_4-1 tile_3-1) 
(up tile_4-2 tile_3-2) 
(up tile_4-3 tile_3-3) 
)
(:goal (and
(painted tile_1-3 black)
))
)

; plan
1. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 0 of 1
2. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 0 of 1
3. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 0 of 1
4. (paint-up robot1 tile_1-3 tile_0-3 black)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 black)
   goals met: 1 of 1
